{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_21", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, null, 195], "dtype": "float32", "sparse": false, "name": "encoder_inputs"}, "name": "encoder_inputs", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "encoderlstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "name": "encoderlstm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 195], "dtype": "float32", "keras_history": ["encoder_inputs", 0, 0]}}], "kwargs": {"training": false, "mask": null}}]}], "input_layers": [["encoder_inputs", 0, 0]], "output_layers": [["encoderlstm", 0, 1], ["encoderlstm", 0, 2]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "encoderlstm/lstm_cell/kernel", "shape": [195, 1024], "dtype": "float32"}, {"name": "encoderlstm/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "encoderlstm/lstm_cell/bias", "shape": [1024], "dtype": "float32"}]}]}