{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_23", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, null, 1], "dtype": "float32", "sparse": false, "name": "decoder_inputs"}, "name": "decoder_inputs", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "decoderlstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "name": "decoderlstm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 1], "dtype": "float32", "keras_history": ["decoder_inputs", 0, 0]}}], "kwargs": {"initial_state": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["input_3", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["input_4", 0, 0]}}], "training": false}}]}, {"class_name": "Dense", "config": {"name": "denselayer", "trainable": true, "dtype": "float32", "units": 7353, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "denselayer", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 256], "dtype": "float32", "keras_history": ["decoderlstm", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["decoder_inputs", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["denselayer", 0, 0], ["decoderlstm", 0, 1], ["decoderlstm", 0, 2]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "decoderlstm/lstm_cell/kernel", "shape": [1, 1024], "dtype": "float32"}, {"name": "decoderlstm/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "decoderlstm/lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "denselayer/kernel", "shape": [256, 7353], "dtype": "float32"}, {"name": "denselayer/bias", "shape": [7353], "dtype": "float32"}]}]}